Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 112, 112, 32) 4704        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 112, 112, 32) 128         conv2d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 112, 112, 32) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 56, 56, 32)   0           re_lu[0][0]                      
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 64)   18432       max_pooling2d[0][0]              
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 28, 28, 64)   256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 28, 28, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 28, 28, 64)   2112        max_pooling2d[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 64)   36864       re_lu_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 28, 28, 64)   0           conv2d_3[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 28, 28, 64)   256         add_1[0][0]                      
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 28, 28, 64)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 14, 14, 128)  73728       re_lu_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 14, 14, 128)  512         conv2d_4[0][0]                   
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 14, 14, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 14, 14, 128)  8320        re_lu_2[0][0]                    
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 14, 14, 128)  147456      re_lu_3[0][0]                    
__________________________________________________________________________________________________
add_3 (Add)                     (None, 14, 14, 128)  0           conv2d_6[0][0]                   
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 14, 14, 128)  512         add_3[0][0]                      
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 14, 14, 128)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 7, 7, 256)    294912      re_lu_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 7, 7, 256)    1024        conv2d_7[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 7, 7, 256)    0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 7, 7, 256)    33024       re_lu_4[0][0]                    
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 7, 7, 256)    589824      re_lu_5[0][0]                    
__________________________________________________________________________________________________
add_5 (Add)                     (None, 7, 7, 256)    0           conv2d_9[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 7, 7, 256)    1024        add_5[0][0]                      
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 7, 7, 256)    0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 7, 7, 32)     73728       re_lu_6[0][0]                    
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 7, 7, 32)     128         conv2d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 7, 7, 32)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 7, 7, 32)     8224        re_lu_6[0][0]                    
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 7, 7, 32)     9216        re_lu_7[0][0]                    
__________________________________________________________________________________________________
add_7 (Add)                     (None, 7, 7, 32)     0           conv2d_12[0][0]                  
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 7, 7, 32)     128         add_7[0][0]                      
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 7, 7, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 32)           0           re_lu_8[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 32)           0           global_average_pooling2d[0][0]   
==================================================================================================
Total params: 1,304,512
Trainable params: 1,302,528
Non-trainable params: 1,984
__________________________________________________________________________________________________
